code/openfoam/test/Lagrangian/injections/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.005;

vertices
(
    (-1 -1 -1) (-1  1 -1) (-1  1  1) (-1 -1  1)
    ( 1 -1 -1) ( 1  1 -1) ( 1  1  1) ( 1 -1  1)
    ( 3 -1 -1) ( 3  1 -1) ( 3  1  1) ( 3 -1  1)
    ( 5 -1 -1) ( 5  1 -1) ( 5  1  1) ( 5 -1  1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 1 1) simpleGrading (1 1 1)
    hex (4 5 6 7 8 9 10 11) cells12 (1 1 1) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) cells12 (1 1 1) simpleGrading (1 1 1)
);

defaultPatch
{
    type empty;
    name frontAndBack;
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (12 13 14 15)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 3 7 4)
            (4 7 11 8)
            (8 11 15 12)
        );
    }
    top
    {
        type wall;
        faces
        (
            (1 2 6 5)
            (5 6 10 9)
            (9 10 14 13)
        );
    }
);

// ************************************************************************* //
