code/openfoam/test/Lagrangian/injections/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kinematicParticle
{
    type        kinematicParticleCloud;
    libs        ("libLagrangianCloud.so");
}

kinematicParcel
{
    type        kinematicParcelCloud;
    libs        ("libLagrangianCloud.so");
}

dynamicParticle
{
    type        dynamicParticleCloud;
    libs        ("libLagrangianCloud.so");
}

dynamicParcel
{
    type        dynamicParcelCloud;
    libs        ("libLagrangianCloud.so");
}

dynamicParticleCount
{
    type        LagrangianFieldValue;
    libs        ("libLagrangianFunctionObjects.so");
    Lagrangian  kinematicParcel;
    operation   sum;
    field       number;
}

diameterDistribution
{
    type        LagrangianDistribution;
    libs        ("libLagrangianFunctionObjects.so");
    Lagrangian  kinematicParcel;
    field       d;
    weightField number;
    nBins       20;
    setFormat   raw;
}

volume
{
    type        cloudVolume;
    libs        ("libLagrangianCloudFunctionObjects.so");
    cloud       dynamicParcel;
}

surfaceArea
{
    type        cloudSurfaceArea;
    libs        ("libLagrangianCloudFunctionObjects.so");
    cloud       dynamicParcel;
}

mass
{
    type        cloudMass;
    libs        ("libLagrangianCloudFunctionObjects.so");
    cloud       dynamicParcel;
}

numberFlux
{
    type        cloudNumberFlux;
    libs        ("libLagrangianCloudFunctionObjects.so");
    cloud       kinematicParcel;
}

boundaryCollisionForce
{
    type        cloudBoundaryCollisionForce;
    libs        ("libLagrangianCloudFunctionObjects.so");
    cloud       dynamicParticle;
}

// ************************************************************************* //
